app/controllers/models_controller.rb

SELECT "models".* FROM "models"
---
	def index
		@models = Model.all()

SELECT  "models".* FROM "models" WHERE "models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@model = Model.find(params[:id])

INSERT INTO "models" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Miran"], ["created_at", "2019-09-04 00:28:32.948830"], ["updated_at", "2019-09-04 00:28:32.948830"]]
---
	def create
		@model = Model.create(model_params)

SELECT  "models".* FROM "models" WHERE "models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@model = Model.find(params[:id])

SELECT  "models".* FROM "models" WHERE "models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "models" SET "name" = ?, "updated_at" = ? WHERE "models"."id" = ?  [["name", "Miran Da Gift"], ["updated_at", "2019-09-04 00:29:45.834932"], ["id", 1]]
---
	def update
		@model = Model.find(params[:id])
		if @model.update_attributes(model_params)

SELECT  "models".* FROM "models" WHERE "models"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "models" WHERE "models"."id" = ?  [["id", 3]]
---
	def destroy
		@model = Model.find(params[:id])
		@model.destroy()